Repository: bardoun7894/aqviooApp
Catalog: lib/l10n/app_*.arb
Languages: ar

# stylePromptSocialMedia
source: engaging social media style with dynamic energy
ar: بأسلوب جذاب لوسائل التواصل الاجتماعي مع طاقة ديناميكية

# stylePromptVintage
source: vintage style with retro aesthetics and aged film look
ar: بأسلوب كلاسيكي مع جماليات قديمة ومظهر فيلم عتيق

# stylePromptFantasy
source: fantasy style with magical and otherworldly elements
ar: بأسلوب خيالي مع عناصر سحرية وأجواء أسطورية

# stylePromptDocumentary
source: documentary style with realistic and observational approach
ar: بأسلوب وثائقي مع نهج واقعي ورصدي

# stylePromptHorror
source: horror style with dark atmosphere and suspenseful mood
ar: بأسلوب رعب مع أجواء مظلمة ومزاج مشوق

# stylePromptComedy
source: comedy style with lighthearted and playful energy
ar: بأسلوب كوميدي مع طاقة مرحة وخفيفة

# stylePromptSciFi
source: sci-fi style with futuristic technology and advanced aesthetics
ar: بأسلوب خيال علمي مع تقنية مستقبلية وجماليات متقدمة

# stylePromptNoir
source: film noir style with high contrast and moody shadows
ar: بأسلوب فيلم نوار مع تباين عالي وظلال درامية

# stylePromptDreamlike
source: dreamlike style with surreal and ethereal atmosphere
ar: بأسلوب حالم مع أجواء سريالية وأثيرية

# stylePromptRetro
source: retro style with 80s and 90s aesthetic
ar: بأسلوب ريترو من الثمانينات والتسعينات

# stylePromptTealFrame
source: professional teal frame with clean card layout, rounded corners, and soft shadows on light background
ar: بإطار أزرق مخضر احترافي مع تخطيط بطاقات نظيف وزوايا مستديرة وظلال ناعمة على خلفية فاتحة

# stylePromptNavyExecutive
source: executive navy blue style with gold accents, formal composition, and corporate elegance
ar: بأسلوب كحلي تنفيذي مع لمسات ذهبية وتكوين رسمي وأناقة مؤسسية

# stylePromptForestGreen
source: nature-inspired forest green palette with organic shapes, earthy tones, and calming atmosphere
ar: بلوحة ألوان خضراء مستوحاة من الطبيعة مع أشكال عضوية ونغمات ترابية وأجواء هادئة

# stylePromptRoyalPurple
source: royal purple elegant style with luxurious gradients, sophisticated typography, and premium feel
ar: بأسلوب بنفسجي ملكي أنيق مع تدرجات فاخرة وطباعة راقية وإحساس فاخر

# stylePromptSunsetOrange
source: warm sunset orange gradient with vibrant energy, golden hour lighting, and inspiring mood
ar: بتدرج برتقالي غروب دافئ مع طاقة نابضة بالحياة وإضاءة الساعة الذهبية ومزاج ملهم

# supportTitle
source: Help & Support
ar: المساعدة والدعم

# supportSubtitle
source: We're here to help! Contact us for any questions or issues.
ar: نحن هنا للمساعدة! تواصل معنا لأي استفسارات أو مشاكل.

source: Email Us
ar: راسلنا عبر البريد الإلكتروني

source: Response Time
ar: وقت الاستجابة

# responseTimeValue
source: Within 24-48 hours
ar: خلال 24-48 ساعة

# faqTitle
source: Frequently Asked Questions
ar: الأسئلة الشائعة

# faqQuestion1
source: How do I create a video?
ar: كيف أنشئ فيديو؟

# faqAnswer1
source: Simply enter your idea in the text field, choose your preferred style and settings, then tap 'Generate'. Our AI will create your video automatically.
ar: ببساطة أدخل فكرتك في حقل النص، اختر الأسلوب والإعدادات المفضلة لديك، ثم اضغط على 'إنشاء'. سيقوم الذكاء الاصطناعي بإنشاء الفيديو الخاص بك تلقائياً.

# faqQuestion2
source: How do credits work?
ar: كيف يعمل نظام الرصيد؟

# faqAnswer2
source: Credits are used to generate videos and images. Each generation costs a certain amount of credits based on the output type and settings.
ar: يُستخدم الرصيد لإنشاء الفيديوهات والصور. كل عملية إنشاء تكلف مبلغاً معيناً من الرصيد بناءً على نوع المخرجات والإعدادات.

# faqQuestion3
source: Can I get a refund?
ar: هل يمكنني استرداد أموالي؟

# faqAnswer3
source: Please contact our support team for refund requests. We review each case individually.
ar: يرجى التواصل مع فريق الدعم لطلبات الاسترداد. نقوم بمراجعة كل حالة على حدة.

# privacyPolicyTitle
source: Privacy Policy
ar: سياسة الخصوصية

# privacyIntro
source: Introduction
ar: مقدمة

# privacyIntroContent
source: At Aqvioo, we respect the privacy of our users and strive to protect their personal data. This policy aims to explain how we collect, use, and protect information when you use our application.
ar: نحن في Aqvioo نحترم خصوصية مستخدمينا ونسعى لحماية بياناتهم الشخصية. تهدف هذه السياسة إلى توضيح كيفية جمع المعلومات واستخدامها وحمايتها عند استخدامك لتطبيقنا.

# privacySection1Title
source: 1. Information We Collect
ar: ١. المعلومات التي نجمعها

# privacySection1Content
source: We collect only the necessary information to operate application services and improve the experience, including: Information provided voluntarily by the user: • Texts or ideas written by the user to create video or image • Images or files uploaded by the user within the app • Contact information (such as email) when contacting us for technical support Technical information (automatically): • Device type, operating system, and app version • General usage data (number of uses, errors, session duration) We do not collect any data that directly identifies the user without their permission.
ar: نجمع بعض المعلومات الضرورية فقط لتشغيل خدمات التطبيق وتحسين التجربة، وتشمل: المعلومات التي يقدمها المستخدم طوعًا: • النصوص أو الأفكار التي يكتبها المستخدم لإنشاء الفيديو أو الصورة • الصور أو الملفات التي يرفعها المستخدم داخل التطبيق • معلومات الاتصال (مثل البريد الإلكتروني) عند التواصل معنا للدعم الفني المعلومات التقنية (تلقائيًا): • نوع الجهاز ونظام التشغيل وإصدار التطبيق • بيانات الاستخدام العامة (عدد مرات الاستخدام، الأخطاء، مدة الجلسة) لا نجمع أي بيانات تحدد هوية المستخدم بشكل مباشر بدون إذنه.

# privacySection2Title
source: 2. Use of Information
ar: ٢. استخدام المعلومات

# privacySection2Content
source: We use the collected information to: • Create requested content (texts, videos, audio) • Improve app performance and user experience • Provide technical support and respond to inquiries • Send notifications or updates related to the app (when enabled by user) We confirm that all data entered for video creation purposes is not used for marketing purposes or external sharing.
ar: نستخدم المعلومات التي يتم جمعها من أجل: • إنشاء المحتوى المطلوب (النصوص، الفيديوهات، الصوتيات) • تحسين أداء التطبيق وتجربة المستخدم • تقديم الدعم الفني والرد على الاستفسارات • إرسال إشعارات أو تحديثات متعلقة بالتطبيق (عند تفعيلها من المستخدم) نؤكد أن جميع البيانات التي يتم إدخالها لغرض إنشاء الفيديو لا تُستخدم لأغراض تسويقية أو مشاركة خارجية.

# privacySection3Title
source: 3. Data Sharing
ar: ٣. مشاركة البيانات

# privacySection3Content
source: We do not share any personal data with third parties.
ar: نحن لا نشارك أي بيانات شخصية مع أطراف ثالثة.

# privacySection4Title
source: 4. Data Storage and Security
ar: ٤. حفظ البيانات وأمنها

# privacySection4Content
source: • Data is retained temporarily only during the video or image creation process • We do not store any user files or texts after the process is completed • We use security and encryption protocols to protect all data during transfer between the user and servers
ar: • يتم الاحتفاظ بالبيانات مؤقتًا فقط أثناء عملية إنشاء الفيديو أو الصورة • لا نقوم بتخزين أي ملفات أو نصوص للمستخدم بعد الانتهاء من العملية • نستخدم بروتوكولات أمان وتشفير لحماية جميع البيانات أثناء النقل بين المستخدم والخوادم

# privacySection5Title
source: 5. Payment Operations
ar: ٥. عمليات الدفع

# privacySection5Content
source: • All payment operations are processed through secure service providers such as Apple Pay, STC Pay, Visa, MasterCard, and Mada • We do not store any credit card information or financial data within the app • All transactions are subject to the security policies of payment providers
ar: • تتم جميع عمليات الدفع من خلال مزودي خدمات آمنة مثل Apple Pay، STC Pay، Visa، MasterCard، Mada • نحن لا نخزن أي معلومات بطاقات ائتمان أو بيانات مالية داخل التطبيق • جميع المعاملات تخضع لسياسات الأمان الخاصة بمزودي الدفع

# privacySection6Title
source: 6. User Rights
ar: ٦. حقوق المستخدم

# privacySection6Content
source: The user has the right to: • Request deletion of their data or images and texts they sent • Stop using the app at any time without any obligation • Contact us for clarifications or complaints via email
ar: للمستخدم الحق في: • طلب حذف بياناته أو الصور والنصوص التي أرسلها • إيقاف استخدام التطبيق في أي وقت دون أي التزام • التواصل معنا لطلب توضيحات أو شكاوى عبر البريد الإلكتروني

# privacySection7Title
source: 7. Privacy Policy Changes
ar: ٧. التعديلات على سياسة الخصوصية

# privacySection7Content
source: We may update this policy from time to time in accordance with technical or legal updates. Users will be notified of any significant changes through the app or email.
ar: قد نقوم بتحديث هذه السياسة من وقت لآخر بما يتناسب مع التحديثات التقنية أو القانونية. سيتم إشعار المستخدمين بأي تغييرات جوهرية من خلال التطبيق أو البريد الإلكتروني.

# privacySection8Title
source: 8. Contact Us
ar: ٨. الاتصال بنا

# privacySection8Content
source: If you have any questions or comments about the privacy policy, you can contact us at: Aqvioo@outlook.sa
ar: إذا كان لديك أي استفسار أو ملاحظة حول سياسة الخصوصية، يمكنك التواصل معنا عبر: Aqvioo@outlook.sa

# notificationVideoReadyTitle
source: Video Ready!
ar: الفيديو جاهز!

# notificationVideoReadyBody
source: Your video has been generated successfully.
ar: تم إنشاء الفيديو بنجاح.

# notificationImageReadyTitle
source: Image Ready!
ar: الصورة جاهزة!

# notificationImageReadyBody
source: Your image has been generated successfully.
ar: تم إنشاء الصورة بنجاح.

# notificationGenerationFailedTitle
source: Generation Failed
ar: فشل الإنشاء

# notificationTimeoutTitle
source: Generation Timed Out
ar: انتهت مهلة الإنشاء

# notificationTimeoutBody
source: Please try again later.
ar: يرجى المحاولة مرة أخرى لاحقًا.

source: Save Changes
ar: حفظ التغييرات
