Repository: bardoun7894/aqviooApp
Catalog: lib/l10n/app_*.arb
Languages: ar

# appTitle
source: Aqvioo
ar: أكفيو

source: Welcome
ar: مرحبا

source: Verify Code
ar: التحقق من الرمز

# enterPhoneToContinue
source: Enter your phone number to continue
ar: أدخل رقم هاتفك للمتابعة

# enterCodeSentTo
source: Enter the code sent to {phoneNumber}
ar: أدخل الرمز المرسل إلى {phoneNumber}

source: Send OTP
ar: إرسال رمز التحقق

source: Change Number
ar: تغيير الرقم

source: Continue as Guest
ar: المتابعة كزائر

source: Back
ar: رجوع

source: Back to login
ar: العودة لتسجيل الدخول

source: Google
ar: جوجل

source: Apple
ar: آبل

# stepIdea
source: Idea
ar: الفكرة

# stepStyle
source: Style
ar: الأسلوب

# stepFinalize
source: Finalize
ar: الإنهاء

# ideaStepPlaceholder
source: Describe your video idea... e.g., 'A futuristic city with flying cars'
ar: صف فكرة الفيديو الخاصة بك... على سبيل المثال، 'مدينة مستقبلية بها سيارات طائرة'

source: Add Image
ar: إضافة صورة

source: Image Added
ar: تمت إضافة الصورة

# buttonBack
source: Back
ar: رجوع

# buttonNext
source: Next
ar: التالي

# promptRequired
source: Please enter a prompt to continue
ar: يرجى إدخال وصف للمتابعة

# alreadyGenerating
source: Already generating! Please wait for current generation to complete.
ar: جاري الإنشاء! يرجى الانتظار حتى اكتمال العملية الحالية.

# errorMessage
source: Error: {error}
ar: خطأ: {error}

source: My Creations
ar: إبداعاتي

source: No creations yet
ar: لا توجد إبداعات بعد

# startCreating
source: Start creating your first video!
ar: ابدأ في إنشاء أول فيديو لك!

source: Create New
ar: إنشاء جديد

source: Video Length
ar: طول الفيديو

source: Aspect Ratio
ar: نسبة العرض إلى الارتفاع

source: Voice Gender
ar: نوع الصوت

source: Male
ar: ذكر

source: Female
ar: أنثى

source: Duration
ar: المدة

source: seconds
ar: ثانية

source: Generate
ar: إنشاء

source: Creating
ar: جاري الإنشاء

# generatingVideo
source: Generating your video...
ar: جاري إنشاء الفيديو...

source: Preview
ar: معاينة

source: Share
ar: مشاركة

source: Download
ar: تحميل

source: Delete
ar: حذف

source: Edit
ar: تعديل

source: Save
ar: حفظ

source: Cancel
ar: إلغاء

source: Login
ar: تسجيل الدخول

source: Email
ar: البريد الإلكتروني

source: Password
ar: كلمة المرور

source: Forgot Password?
ar: نسيت كلمة المرور؟

# dontHaveAccount
source: Don't have an account?
ar: ليس لديك حساب؟

source: Sign Up
ar: إنشاء حساب

source: OR
ar: أو

source: Continue with Google
ar: المتابعة باستخدام جوجل

source: Continue with Apple
ar: المتابعة باستخدام آبل

source: Creating Magic...
ar: جاري الإنشاء بسحر...

source: Almost Done!
ar: تقريباً انتهينا!

# processingVideo
source: Processing your video
ar: جاري معالجة الفيديو

source: This will take a moment
ar: سيستغرق هذا لحظة

source: Video Preview
ar: معاينة الفيديو

source: Play/Pause
ar: تشغيل/إيقاف

source: Restart
ar: إعادة التشغيل

source: Download Video
ar: تحميل الفيديو

source: Share Video
ar: مشاركة الفيديو

source: Delete Video
ar: حذف الفيديو

# confirmDelete
source: Are you sure you want to delete this video?
ar: هل أنت متأكد من حذف هذا الفيديو؟

source: Settings
ar: الإعدادات

source: Language
ar: اللغة

source: Select Language
ar: اختر اللغة

source: Arabic
ar: العربية

source: Theme
ar: المظهر

source: Light Mode
ar: الوضع الفاتح

source: Dark Mode
ar: الوضع الداكن

source: System Default
ar: النظام الافتراضي

source: Notifications
ar: الإشعارات

source: Account
ar: الحساب

source: Profile
ar: الملف الشخصي

source: Logout
ar: تسجيل الخروج

source: About
ar: حول

source: Version
ar: الإصدار

source: Terms of Service
ar: شروط الخدمة

source: Privacy Policy
ar: سياسة الخصوصية

source: Payment
ar: الدفع

source: Proceed to Payment
ar: المتابعة للدفع

source: Payment Successful
ar: تم الدفع بنجاح

source: Payment Failed
ar: فشل الدفع

source: Total
ar: الإجمالي

source: Price
ar: السعر

source: Gallery
ar: المعرض

source: Select Media
ar: اختر الوسائط

source: Photos
ar: الصور

source: Videos
ar: الفيديوهات

source: Recent Media
ar: الوسائط الحديثة

source: Loading...
ar: جاري التحميل...

source: Retry
ar: إعادة المحاولة

source: Success
ar: نجح

source: Failed
ar: فشل

source: Warning
ar: تحذير

# info
source: Information
ar: معلومات

source: Confirm
ar: تأكيد

source: Close
ar: إغلاق

# step1Script
source: Script
ar: البرنامج النصي

# step2Voice
source: Voice
ar: الصوت

# step3Video
source: Video
ar: الفيديو

source: All
ar: الكل

source: Images
ar: الصور

# noCreationsYetMessage
source: Start creating your first video!
ar: ابدأ في إنشاء أول فيديو لك!

source: Select Video
ar: اختر الفيديو

source: Enter Password
ar: أدخل كلمة المرور

source: Account Settings
ar: إعدادات الحساب

source: OTP Verification
ar: التحقق من رمز التحقق

source: Enter OTP
ar: أدخل رمز التحقق

source: Verify
ar: تحقق

source: Resend
ar: إعادة إرسال

# twoFactor
source: Two-Factor Authentication
ar: المصادقة الثنائية

source: Music Track
ar: مسار موسيقي

source: Voice Narration
ar: سرد صوتي

source: No Music Selected
ar: لم يتم تحديد موسيقى

source: No Voice Selected
ar: لم يتم تحديد صوت

source: Select Music Track
ar: اختر مسار موسيقي

source: Add Voice Narration
ar: أضف سرد صوتي

source: Confirmation
ar: تأكيد

# reviewCreation
source: Review Your Creation
ar: راجع إبداعك

# titleRequired
source: Title is required
ar: العنوان مطلوب

source: Description (optional)
ar: الوصف (اختياري)

source: Creation Title
ar: عنوان الإبداع

# creationDescription
source: Description
ar: الوصف

source: Tap to Unlock
ar: اضغط لفتح القفل

source: App Locked
ar: التطبيق مقفول

source: Unknown Error
ar: خطأ غير معروف

source: Try Again
ar: حاول مرة أخرى

source: Processing
ar: قيد المعالجة

# waitForOtp
source: Waiting for OTP code
ar: في انتظار رمز التحقق

source: Empty
ar: فارغ

source: Name
ar: الاسم

source: Created
ar: تم الإنشاء

# dateFormat
source: MMM dd, yyyy
ar: dd MMM، yyyy

# deleteConfirmation
source: Are you sure?
ar: هل أنت متأكد؟

# deleteCreationMsg
source: This action cannot be undone
ar: لا يمكن التراجع عن هذا الإجراء

source: Yes
ar: نعم

source: No
ar: لا

# copied
source: Copied to clipboard
ar: تم النسخ إلى الحافظة

source: Error
ar: خطأ

source: OK
ar: موافق

# whatToCreate
source: What would you like to create?
ar: ماذا تريد أن تنشئ؟

# describeYourIdea
source: Describe your video idea and let AI do the magic.
ar: صف فكرة الفيديو الخاصة بك ودع الذكاء الاصطناعي يقوم بالسحر.

source: Enhance
ar: تحسين

source: Prompt enhanced! ✨
ar: تم تحسين الوصف! ✨

# charsCount
source: {count} chars
ar: {count} حرف

# guestLoginDisabled
source: Guest login is disabled. Please enable Anonymous Auth in Firebase Console.
ar: تم تعطيل تسجيل الدخول كضيف. يرجى تفعيل المصادقة المجهولة في وحدة تحكم Firebase.

source: Full Name
ar: الاسم الكامل

source: Enter your name
ar: أدخل اسمك

source: Phone Number
ar: رقم الهاتف

source: Privacy
ar: الخصوصية

source: Delete Account
ar: حذف الحساب

# appName
source: Aqvioo
ar: أكفيو

# appSubtitle
source: AI-Powered Content Creation
ar: إنشاء محتوى بقوة الذكاء الاصطناعي

source: 📝 Your Idea
ar: 📝 فكرتك

# settingsSection
source: ⚙️ Settings
ar: ⚙️ الإعدادات

source: Output Type
ar: نوع المخرجات

source: Video
ar: فيديو

source: Image
ar: صورة

source: Style
ar: الأسلوب

# aspectRatio16x9
source: 16:9 (Horizontal)
ar: 16:9 (أفقي)

# aspectRatio9x16
source: 9:16 (Vertical)
ar: 9:16 (رأسي)

source: Voice
ar: الصوت

source: Size
ar: الحجم

# costSection
source: 💰 Cost
ar: 💰 التكلفة

source: Login Required
ar: تسجيل الدخول مطلوب

# pleaseLoginToGenerate
source: Please login to generate your video.
ar: يرجى تسجيل الدخول لإنشاء الفيديو الخاص بك.

source: Generate Magic
ar: إنشاء السحر

# dialectSaudi
source: Saudi
ar: السعودية

# dialectEgyptian
source: Egyptian
ar: مصر

# dialectUAE
source: UAE
ar: الإمارات

# dialectLebanese
source: Lebanese
ar: لبنان

# dialectJordanian
source: Jordanian
ar: الأردن

# dialectMoroccan
source: Moroccan
ar: المغرب

# sizeSquare
source: Square (1024x1024)
ar: مربع (1024x1024)

# sizeLandscape
source: Landscape (1920x1080)
ar: أفقي (1920x1080)

# sizePortrait
source: Portrait (1080x1920)
ar: رأسي (1080x1920)

# chooseVisualMood
source: Choose the visual mood of your video
ar: اختر المظهر البصري للفيديو الخاص بك

source: Select video length
ar: حدد طول الفيديو

source: Choose video orientation
ar: اختر اتجاه الفيديو

source: Configure narrator voice
ar: قم بتكوين صوت الراوي

# durationQuick
source: Quick
ar: سريع

# durationStandard
source: Standard
ar: قياسي

source: Best for YouTube
ar: الأفضل لـ YouTube

source: Best for TikTok
ar: الأفضل لـ TikTok

# noCreationsYetTitle
source: No creations yet
ar: لا توجد إبداعات بعد

# startCreatingVideos
source: Start creating amazing videos!
ar: ابدأ في إنشاء مقاطع فيديو رائعة!

# scriptStep
source: Script
ar: البرنامج النصي

# audioStep
source: Audio
ar: الصوت

# videoStep
source: Video
ar: الفيديو

# backgroundGenerationInfo
source: You can safely exit the app. Your video will continue generating in the background.
ar: يمكنك إغلاق التطبيق بأمان. سيستمر الفيديو في الإنشاء في الخلفية.

source: Media Gallery
ar: معرض الوسائط

source: Create Now
ar: إنشاء الآن

# videoDownloadSuccess
source: Video downloaded to temp folder! Note: Gallery save requires additional permissions.
ar: تم تحميل الفيديو إلى مجلد مؤقت! ملاحظة: حفظ المعرض يتطلب أذونات إضافية.

# downloadError
source: Error: {error}
ar: خطأ: {error}

# shareError
source: Share failed: {error}
ar: فشل المشاركة: {error}

source: Complete Your Payment
ar: أكمل الدفع

source: Total Amount
ar: المبلغ الإجمالي

source: Pay with Tabby
ar: الدفع عبر تابي

source: Pay with Tap
ar: الدفع عبر تاب

source: Pay with Apple Pay
ar: الدفع عبر Apple Pay

source: Pay with STC Pay
ar: الدفع عبر STC Pay

source: Pay with Card
ar: الدفع عبر البطاقة

source: Email or Phone
ar: البريد الإلكتروني أو الهاتف

source: Sign In
ar: تسجيل الدخول

# continueButton
source: Continue
ar: متابعة

source: Confirm Password
ar: تأكيد كلمة المرور

# alreadyHaveAccount
source: Already have an account?
ar: هل لديك حساب بالفعل؟

source: Phone
ar: الهاتف

source: Create Account
ar: إنشاء حساب

# joinAndStartCreating
source: Join and start creating amazing videos
ar: انضم وابدأ في إنشاء مقاطع فيديو رائعة

# styleHeader
source: Style
ar: الأسلوب

# durationHeader
source: Duration
ar: المدة

# aspectRatioHeader
source: Aspect Ratio
ar: نسبة العرض

# voiceSettingsHeader
source: Voice Settings
ar: إعدادات الصوت

# sizeHeader
source: Size
ar: الحجم

source: Quick
ar: سريع

source: Standard
ar: قياسي

source: Horizontal
ar: أفقي

source: Vertical
ar: رأسي

source: Square
ar: مربع

source: Landscape
ar: أفقي

source: Portrait
ar: رأسي

source: Recent Projects
ar: المشاريع الأخيرة

source: View All
ar: عرض الكل

source: Create Magic
ar: إنشاء السحر

source: Product Ad
ar: إعلان منتج

source: Social Reel
ar: ريل تواصل

# render3D
source: 3D Render
ar: تصيير ثلاثي الأبعاد

source: Avatar
ar: أفاتار

source: Advanced Settings
ar: إعدادات متقدمة

source: Credits
ar: الرصيد

source: View Library
ar: عرض المكتبة

# modelVersion
source: Model v4.0
ar: الإصدار 4.0

source: Generating...
ar: جاري الإنشاء...

source: Quick Suggestions
ar: اقتراحات سريعة

# buyCredits
source: Add Balance
ar: إضافة رصيد

source: Current Balance
ar: الرصيد الحالي

source: Credit Balance
ar: رصيد الأرصدة

# purchaseCredits
source: Add {count} ﷼ - {price} SAR
ar: إضافة {count} ريال - {price} ريال

# videosOrImages
source: {videos} videos or {images} images
ar: {videos} فيديو أو {images} صورة

# popularBadge
source: Popular
ar: الأكثر شعبية

# bestValueBadge
source: Best Value
ar: أفضل قيمة

# tabbyInstallments
source: Split your purchase into 4 interest-free payments
ar: قسّم مشترياتك إلى 4 دفعات بدون فوائد

# paymentsOf
source: 4 payments of
ar: 4 دفعات بقيمة

# tabbyBenefits
source: • Pay the first installment now • Remaining 3 payments every 2 weeks • No interest, no fees
ar: • ادفع الدفعة الأولى الآن • الدفعات الـ 3 المتبقية كل أسبوعين • لا فوائد، لا رسوم

source: Continue to Tabby
ar: المتابعة إلى تابي

# tapPaymentInfo
source: Secure payment with credit/debit card via Tap Payments
ar: دفع آمن عبر بطاقة ائتمان/خصم من تاب

# tapPaymentMethods
source: Supported: Visa, Mastercard, MADA, American Express
ar: مدعوم: فيزا، ماستركارد، مدى، أمريكان إكسبريس

source: Balance to add
ar: الرصيد المضاف

source: Continue to Payment
ar: المتابعة للدفع

# addedToBalance
source: added to your balance
ar: تمت إضافته لرصيدك

# securePaymentTap
source: Secure payment powered by Tap
ar: دفع آمن عبر تاب

# firstPayment
source: First payment: {amount} SAR
ar: الدفعة الأولى: {amount} ريال

# paymentSuccessTitle
source: Payment Successful!
ar: تم الدفع بنجاح!

# creditsAdded
source: {count} credits have been added to your account
ar: تمت إضافة {count} رصيد إلى حسابك

# startCreatingButton
source: Start Creating
ar: ابدأ الإنشاء

# paymentFailedTitle
source: Payment Failed
ar: فشل الدفع

# paymentFailedMessage
source: Unable to process payment. Please try again.
ar: تعذرت معالجة الدفع. يرجى المحاولة مرة أخرى.

# securePaymentTabby
source: Secure buy now, pay later with Tabby
ar: اشترِ الآن وادفع لاحقاً بأمان عبر تابي

source: Insufficient Credits
ar: رصيد غير كافٍ

# needCreditsMessage
source: You need {count} credits to generate a {type}.
ar: تحتاج إلى {count} رصيد لإنشاء {type}.

# yourBalance
source: Your balance: {count} credits
ar: رصيدك: {count} رصيد

# enhancingIdea
source: Enhancing your idea...
ar: جاري تحسين فكرتك...

# enhancingVideoIdea
source: Enhancing your video idea...
ar: جاري تحسين فكرة الفيديو...

# enhancingImageIdea
source: Enhancing your image idea...
ar: جاري تحسين فكرة الصورة...

# preparingPrompt
source: Preparing your prompt...
ar: جاري تحضير الوصف...

# preparingVideoPrompt
source: Preparing your video prompt...
ar: جاري تحضير وصف الفيديو...

# preparingImagePrompt
source: Preparing your image prompt...
ar: جاري تحضير وصف الصورة...

# bringingImageToLife
source: Bringing your image to life...
ar: جاري تحويل صورتك إلى حياة...

# creatingVideo
source: Creating your video...
ar: جاري إنشاء الفيديو...

# generatingImage
source: Generating your image...
ar: جاري إنشاء الصورة...

# creatingMasterpiece
source: Creating your masterpiece...
ar: جاري إنشاء تحفتك...

# creatingVideoMasterpiece
source: Creating your video masterpiece...
ar: جاري إنشاء تحفة الفيديو...

# creatingImageMasterpiece
source: Creating your image masterpiece...
ar: جاري إنشاء تحفة الصورة...

source: Magic Complete!
ar: اكتمل السحر!

source: Video Complete!
ar: اكتمل الفيديو!

source: Image Complete!
ar: اكتملت الصورة!

# generatingVideoTitle
source: Generating Video
ar: جاري إنشاء الفيديو

# generatingImageTitle
source: Generating Image
ar: جاري إنشاء الصورة

source: Library
ar: المكتبة

source: All Creations
ar: جميع الإبداعات

source: Play Video
ar: تشغيل الفيديو

source: View Image
ar: عرض الصورة

# createdOn
source: Created on {date}
ar: تم الإنشاء في {date}

source: Check later in My Creations
ar: تحقق لاحقاً في إبداعاتي

source: Creator
ar: منشئ

source: Speech recognition not available
ar: التعرف على الصوت غير متاح

# microphonePermissionRequired
source: Microphone permission is required
ar: يجب منح إذن الميكروفون

# failedToEnhancePrompt
source: Failed to enhance prompt: {error}
ar: فشل في تحسين الوصف: {error}

source: More Styles
ar: المزيد من الأنماط

source: Show Less
ar: عرض أقل

source: Enhancing...
ar: جاري التحسين...

# didNotReceiveCode
source: Didn't receive the code?
ar: لم تستلم الرمز؟

# weSentCodeTo
source: We sent a code to
ar: لقد أرسلنا رمزًا إلى

# youWillGenerate
source: You will generate {label}
ar: سوف تقوم بإنشاء {label}

source: YOUR GALLERY
ar: معرضك

# emptyGalleryDescription
source: Start creating amazing AI-generated videos and images with just a few taps
ar: ابدأ في إنشاء مقاطع فيديو وصور مذهلة بواسطة الذكاء الاصطناعي ببضع نقرات فقط

source: Create Your First
ar: أنشئ أول فيديو لك

source: Generating Magic...
ar: جاري إنشاء السحر...

source: Generation timed out
ar: انتهت مهلة الإنشاء

source: Cinematic
ar: سينمائي

source: Real Estate
ar: عقارات

source: Educational
ar: تعليمي

source: Corporate
ar: شركات

source: Gaming
ar: ألعاب

source: Music Video
ar: فيديو موسيقي

source: Documentary
ar: وثائقي

# adminDashboard
source: Dashboard
ar: لوحة المعلومات

# adminUsers
source: Users
ar: المستخدمون

# adminContent
source: Content
ar: المحتوى

# adminPayments
source: Payments
ar: المدفوعات

# adminSettings
source: Settings
ar: الإعدادات

source: Dashboard Metrics
ar: مقاييس لوحة المعلومات

source: Total Users
ar: إجمالي المستخدمين

source: Total Videos
ar: إجمالي الفيديوهات

source: Total Revenue
ar: إجمالي الإيرادات

source: Videos Generated
ar: فيديوهات تم إنشاؤها

source: Active Generations
ar: عمليات الإنشاء النشطة

source: Success Rate
ar: معدل النجاح

source: Recent Users
ar: المستخدمون الأخيرون

source: Recent Videos
ar: الفيديوهات الأخيرة

source: Recent Transactions
ar: المعاملات الأخيرة

source: User List
ar: قائمة المستخدمين

# searchByEmail
source: Search by email or username
ar: ابحث برسالة بريد إلكترونية أو اسم مستخدم

# phoneNumberLabel
source: Phone
ar: الهاتف

# creditsLabel
source: Credits
ar: الأرصدة

# statusLabel
source: Status
ar: الحالة

# actionLabel
source: Action
ar: إجراء

source: Ban User
ar: حظر المستخدم

source: Unban User
ar: إلغاء حظر المستخدم

source: View Details
ar: عرض التفاصيل

source: Content Management
ar: إدارة المحتوى

# searchByPrompt
source: Search by prompt or user
ar: ابحث بالطلب أو اسم المستخدم

# typeFilter
source: Type
ar: النوع

# statusFilter
source: Status
ar: الحالة

source: All Types
ar: جميع الأنواع

source: All Status
ar: جميع الحالات

source: Completed
ar: مكتمل

# contentPreview
source: Preview
ar: معاينة

source: Copy URL
ar: نسخ الرابط

source: User Information
ar: معلومات المستخدم

source: Joined
ar: انضم في

source: Adjust Credits
ar: ضبط الأرصدة

source: Amount
ar: المبلغ

source: Reason
ar: السبب

source: Bonus
ar: مكافأة

source: Refund
ar: استرجاع

source: Correction
ar: تصحيح

source: Other
ar: آخر

# notes
source: Notes (optional)
ar: ملاحظات (اختياري)

source: Account Status
ar: حالة الحساب

source: Active
ar: نشط

source: Banned
ar: محظور

source: Banned on
ar: تم الحظر في

# banReason
source: Reason
ar: السبب

source: Recent Creations
ar: الإبداعات الأخيرة

# noCreations
source: No creations yet
ar: لا توجد إبداعات حتى الآن

source: Payments List
ar: قائمة المدفوعات

source: Payment ID
ar: معرّف الدفع

# paymentStatus
source: Status
ar: الحالة

# paymentDate
source: Date
ar: التاريخ

source: Transaction ID
ar: معرّف المعاملة

# adminLogout
source: Logout
ar: تسجيل الخروج

source: Admin Profile
ar: ملف المسؤول

# adminEmail
source: Email
ar: البريد الإلكتروني

# adminRole
source: Role
ar: الدور

# adminPermissions
source: Permissions
ar: الصلاحيات

source: Switch to App
ar: التبديل إلى التطبيق

source: Administrator
ar: مسؤول النظام

source: Are you sure?
ar: هل أنت متأكد؟

# deleteContentMsg
source: This content will be permanently deleted
ar: سيتم حذف هذا المحتوى بشكل دائم

# confirmBan
source: Are you sure you want to ban this user?
ar: هل أنت متأكد من حظر هذا المستخدم؟

# unbanConfirm
source: Are you sure you want to unban this user?
ar: هل أنت متأكد من إلغاء حظر هذا المستخدم؟

source: User not found
ar: لم يتم العثور على المستخدم

source: Content not found
ar: لم يتم العثور على المحتوى

# creditsAdjusted
source: Credits adjusted successfully
ar: تم ضبط الأرصدة بنجاح

# userBanned
source: User has been banned
ar: تم حظر المستخدم

# userUnbanned
source: User has been unbanned
ar: تم إلغاء حظر المستخدم

# contentDeleted
source: Content deleted successfully
ar: تم حذف المحتوى بنجاح

source: Error adjusting credits
ar: خطأ في ضبط الأرصدة

source: Error banning user
ar: خطأ في حظر المستخدم

source: Error loading users
ar: خطأ في تحميل المستخدمين

source: Error loading content
ar: خطأ في تحميل المحتوى

# profileUpdatedSuccess
source: Profile updated successfully
ar: تم تحديث الملف الشخصي بنجاح

# profileUpdateFailed
source: Failed to update profile
ar: فشل تحديث الملف الشخصي

# enhanceCinematic
source: with cinematic lighting and professional color grading
ar: بإضاءة سينمائية وتصحيح ألوان احترافي

# enhance4K
source: in stunning 4K quality with dramatic atmosphere
ar: بجودة 4K مذهلة وجو درامي

# enhanceMusic
source: with epic music and smooth transitions
ar: مع موسيقى ملحمية وانتقالات سلسة

# enhanceDynamic
source: featuring dynamic camera movements and vivid colors
ar: بلمسات ديناميكية وألوان زاهية

# enhanceHollywood
source: with Hollywood-style production value
ar: بجودة إنتاج سينمائية

# enhancePremium
source: in premium quality with artistic composition
ar: بجودة ممتازة وتكوين فني

source: Help & Support
ar: المساعدة والدعم

# accountSettingsTitle
source: ACCOUNT SETTINGS
ar: إعدادات الحساب

# enterName
source: Enter your name
ar: أدخل اسمك

# enterPhone
source: Enter your phone number
ar: أدخل رقم هاتفك

# logoutConfirmationTitle
source: Logout
ar: تسجيل الخروج

# logoutConfirmationMessage
source: Are you sure you want to logout?
ar: هل أنت متأكد أنك تريد تسجيل الخروج؟

# deleteAccountTitle
source: Delete Account
ar: حذف الحساب

# deleteAccountMessage
source: This action cannot be undone. All your data will be permanently deleted.
ar: لا يمكن التراجع عن هذا الإجراء. سيتم حذف جميع بياناتك بشكل دائم.

# paymentMobileOnly
source: Payments are only available on the mobile app
ar: المدفوعات متاحة فقط على تطبيق الجوال

source: Image Preview
ar: معاينة الصورة

# videoPreviewTitle
source: Video Preview
ar: معاينة الفيديو

# saveToPhotos
source: Save
ar: حفظ

source: Remix
ar: إعادة إنشاء

source: Loop
ar: تكرار

source: No Loop
ar: بدون تكرار

source: Prompt
ar: الوصف

source: No prompt available
ar: لا يوجد وصف متاح

source: Prompt Details
ar: تفاصيل الوصف

# tryAgainWithPrompt
source: Try Again with this Prompt
ar: حاول مرة أخرى بهذا الوصف

source: Generate New Video?
ar: إنشاء فيديو جديد؟

source: Generate New Content?
ar: إنشاء محتوى جديد؟

# chooseVariation
source: Choose how you want to create a new variation
ar: اختر كيف تريد إنشاء نسخة جديدة

source: Use Same Prompt
ar: استخدام نفس الوصف

source: Enhance Prompt
ar: تحسين الوصف

source: New Prompt
ar: وصف جديد

# savedToPhotos
source: Saved to Photos successfully!
ar: تم الحفظ في الصور بنجاح!

# failedToSave
source: Failed to save to Photos. Access denied?
ar: فشل الحفظ في الصور. هل تم رفض الإذن؟

# shareFailed
source: Share failed: {error}
ar: فشلت المشاركة: {error}

# listView
source: List
ar: قائمة

# gridView
source: Grid
ar: شبكة

# styleCinematic
source: Cinematic
ar: سينمائي

# styleAnimation
source: Animation
ar: رسوم متحركة

# styleMinimal
source: Minimal
ar: بسيط

# styleModern
source: Modern
ar: عصري

# styleCorporate
source: Corporate
ar: احترافي

# styleSocialMedia
source: Social Media
ar: سوشيال ميديا

# styleVintage
source: Vintage
ar: كلاسيكي

# styleFantasy
source: Fantasy
ar: خيالي

# styleDocumentary
source: Documentary
ar: وثائقي

# styleHorror
source: Horror
ar: رعب

# styleComedy
source: Comedy
ar: كوميدي

# styleSciFi
source: Sci-Fi
ar: خيال علمي

# styleNoir
source: Noir
ar: نوار

# styleDreamlike
source: Dreamlike
ar: حالم

# styleRetro
source: Retro
ar: ريترو

# styleTealFrame
source: Teal Frame
ar: إطار أزرق مخضر

# styleNavyExecutive
source: Navy Executive
ar: كحلي تنفيذي

# styleForestGreen
source: Forest Green
ar: أخضر طبيعي

# styleRoyalPurple
source: Royal Purple
ar: بنفسجي ملكي

# styleSunsetOrange
source: Sunset Orange
ar: برتقالي غروب

# stylePromptCinematic
source: cinematic style with dramatic lighting and composition
ar: بأسلوب سينمائي مع إضاءة درامية وتكوين احترافي

# stylePromptAnimation
source: animated style with vibrant colors and smooth motion
ar: بأسلوب رسوم متحركة مع ألوان نابضة بالحياة وحركة سلسة

# stylePromptMinimal
source: minimal and clean aesthetic with simple compositions
ar: بأسلوب بسيط ونظيف مع تكوينات مبسطة

# stylePromptModern
source: modern and contemporary style
ar: بأسلوب عصري ومعاصر

# stylePromptCorporate
source: professional corporate style
ar: بأسلوب احترافي للشركات
